# GISDimStringToMM

## Description
Converts string value that represents dimension real to real number in millimeters.

```pascal
FUNCTION GISDimStringToMM(
				inputStr          : STRING;
				footMarkException : STRING) : REAL;
```

```python

def vs.GISDimStringToMM(inputStr, footMarkException):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inputStr|STRING||
|footMarkException|STRING||

## Version
Availability: from Vectorworks 2024
## Category
* GIS